export const ua = {
  menu: {
    main: "Головна",
    sneakers: "ТОВАРИ",
    cart: "Кошик",
  },

  sneakersSection: {
    headerTitle: "ВСІ ТОВАРИ",
    headerSubTitle:
      "Купуйте новинки таких відомих імен, як Air Jordan, Nike, New Balance і Yeezy, а також найновіші колаборації таких брендів, як Vans, Reebok, Converse, ASICS тощо.",
    filterSneakers: {
      filterTitle: "Фільтр",
      model: "Модель",
      sizes: "Розміри",
      brand: "Бренд",
      price: "Ціна",
      year: "Рік",
    },
    apply: "застосовувати",
    from: "від",
    to: "до",
    filterErrors: {
      yearBiggerLower: "Рік 'Від' не може бути більше ніж 'До'",
      yearBigger: "Рік не може бути більше ніж 2023",
      yearLower: "Рік не може бути менше ніж 1994",
      priceBiggerLower: "Ціна 'Від' не може бути більше ніж 'До'",
      priceBigger: "Ціна не може бути більше ніж 6000",
      priceLower: "Ціна не може бути менше ніж 10",
    },
    sneakersResult: {
      resultsTitle: "Результати",
      show: "Показувати",
      sort: {
        sotrBy: "Сортувати:",
        relevance: "Актуальність",
        low: "Спочатку дешеві",
        high: "Спочатку дорогі",
        newest: "Новинки",
        trending: "Популярність",
      },
      emptyText: {
        notFound: "Вибачте, результатів не знайдено",
        checkFilters:
          "Будь ласка, перевірте фільтри або перегляньте інші фільтри та товари",
      },
    },
  },

  mainSection: {
    shopNow: "здійснити покупку",
    newReleases: {
      title: "ТОВАР ДНЯ",
      button: "БІЛЬШЕ ТОВАРІВ",
    },
    staffPicks: {
      title: "НАЙКРАЩИЙ ВИБІР",
      button: "БІЛЬШЕ ТОВАРІВ",
    },
    about: {
      titleStore: "Про нас",
      titleHistory: "Якість товару",
      textStore:
        "Ми є вашим надійним джерелом для всього, що пов'язано з домашніми улюбленцями. У нас ви знайдете широкий асортимент якісних товарів для догляду, годування та розваги вашого улюбленця. Наша команда експертів завжди готова допомогти вам з вибором найкращого для вашого улюбленця.",
      textHistory:
        "Наш зоомагазин пишається тим, що наші покупці завжди отримують товари найвищої якості для своїх улюбленців. Ми працюємо тільки з надійними постачальниками, щоб забезпечити, що кожен товар, що знаходиться на наших полицях, відповідає найвищим стандартам якості. Відгуки і задоволення наших клієнтів підтверджують, що вони можуть довіряти нам, коли ставиться питання про здоров'я і добробут їхніх улюбленців.",
    },
  },

  cartSection: {
    title: "Ваш кошик з замовленням",
    total: "РАЗОМ",
    buttonOrder: "Оформити замовлення",
    size: "Варіант",
    emptyCart: "Кошик порожній",
  },

  favoriteSection: {
    title: "Обрані товари",
    emptyFavorites: "Ви ще не додали товари до обраних",
  },

  sneakerPage: {
    size: "Варіант",
    buy: "Купити за",
    goToCart: "Перейти до кошику",
    addedToCart: "Товар доданий до кошика",
    delivery: {
      title: "Доставка та повернення",
      cancelations: "Скасування",
      cancelationsDescription1:
        "Ви можете скасувати своє замовлення протягом 3 годин після його розміщення або до того, як його підтвердить продавець - залежно від того, що з’явиться першим.Якщо 3 години минуло, коли ви розмістили замовлення та/або продавець вже підтвердив замовлення, то замовлення неможливо скасувати.Якщо не відбулося, ви можете спочатку скасувати своє замовлення.",
      cancelationsDescription2:
        "Також скасувати можна через адміністратора по телефону.",
      delivery: "Доставка",
      deliveryDescription1:
        "Швидкість доставки та обробки змінюється залежно від варіантів ціноутворення.Наступні оцінки доставки стосуються лише наявності товару. Усі часи доставки - це оцінки і не гарантуються. Відвантаження можуть впливати на затримки, пов'язані з погодою, обмеження перевізників або інші події поза нашим контролем.",
      deliveryDescription2:
        "Замовлення 'найнижчої ціни' можуть першим доставити до польотного клубу для перевірки і, як правило, потрібно 7-10 робочих днів (виключаючи вихідні), щоб дістатися до вас.Зазвичай це займе 3-5 робочих днів (за винятком вихідних).",
      deliveryDescription3:
        "Орієнтовні терміни доставки не застосовуються до міжнародних замовлень. Міжнародні клієнти несуть відповідальність за будь-які додаткові збори або податки після товару.",
      returns: "Повернення",
      returnsDescription1: "Усі продажі є остаточними.",
      returnsDescription2:
        "Якщо у вас є якісь питання чи проблеми щодо товару або стану, будь ласка, зв'яжіться з нами перед покупкою.",
    },
    recommended: "РЕКОМЕНДОВАНО ДЛЯ ВАС",
  },

  placeOrderSection: {
    orderConfirmed: {
      title: "Замовлення підтверджено",
      hint: "зачекайте відповіді нашого менеджера електронною поштою",
      button: "Повернутися на головну",
    },
    title: "ІНФОРМАЦІЯ ПРО ЗАМОВЛЕННЯ",
    email: "Ваша електронна адреса",
    name: "Повне ім'я",
    address: "Адреса доставки",
    city: "Місто",
    zip: "Поштовий індекс",
    telephone: "Телефон",
    emailPlaceholrer: "електронна пошта",
    namePlaceholrer: "ім'я",
    addressPlaceholrer: "адреса",
    cityPlaceholrer: "місто",
    zipPlaceholrer: "індекс",
    telephonePlaceholrer: "номер",
    makeOrderBTN: "Підтвердити замовлення",
  },

  inputErrors: {
    enterEmail: "введіть адресу електронної пошти",
    incorrect: "неправильна адреса електронної пошти",
    enterFullName: "введіть ваше повне ім'я",
    enterFirstAndLastName: "введіть прізвище та прізвище",
    enterAddress: "введіть свою адресу",
    enterCity: "введіть своє місто",
    enterZip: "введіть поштовий індекс",
    incorrectZip: "неправильний поштовий індекс",
    wrongNumberDigits: "неправильна кількість цифр",
    incorrectTelephone: "неправильний номер телефону",
  },
};
